   # Итоговая проверочная работа.
Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения по программе разработчик.

1. Необходимо создать репозиторий на GitHub.
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод).
3. Снабдить репозиторий оформленным текстовыи описанием решения ( файл Readve.md).
4. Написать программу, решающую поставленную задачу.
5. Использовать контроль версий в работе над этим небольшим проектом ( не должно быть так, что все залито одним коммитом, как минимум этамы 2, 3, 4 должны быть расположенны в разных коммитах). 
  Задача:
Написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел.
Первоначальный массив можно ввести с клавиатуры, либо сгенерировать случайным образом. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
Для создания нового массива, необходимо перебрать имеющийся на четность, для этого нужно последовательно перебрать все числа разделив их на два, и если нет остатка, то записать их в новый массив. Потом вывести его на экран.



int[] array = new int[20];

Random rnd = new Random();

for (int i = 0; i < array.Length; i++)
{
    array[i] = rnd.Next(100, 999);
    Console.Write(array[i] + ", ");
}

for (int i = 0; i < array.Length; i++)
{
    if (array[i] % 2 == 0)
    {
        System.Console.WriteLine(array[i] + ", ");
    }
}
